// This file can be replaced during build by using the `fileReplacements` array.
// `ng build` replaces `environment.ts` with `environment.prod.ts`.
// The list of file replacements can be found in `angular.json`.

export const environment = {
  production: false,
  coronaApiUrl:
    'https://data.gov.il/api/3/action/datastore_search?resource_id=',
  sidemenuItems: [
    {
      title: 'עולמות תוכן',
      items: ['קורונה', 'עולמות תוכן נוספים בקרוב...'],
    },
    {
      title: 'עולם הדאטה',
      items: ['הי-DATA', 'GIS', 'Data_Gov'],
    },
    {
      title: 'על הדשבורד',
      items: ['אודות', 'תנאי שימוש', 'מדריך למשתמש'],
    },
  ],
  cards: [
    {
      title: { title: 'מאומתים אתמול', value: '387' },
      stats: [
        { title: 'מחצות', value: '73' },
        { title: 'סה"כ', value: '4,677,357' },
        { title: 'חולים פעילים', value: '6,044' },
      ],
      tooltip: `מספר המאומתים לנגיף COVID-19 שאותרו משעה 00:00 עד שעה 23:59 של יום אתמול.

      סה"כ: מספר המאומתים מפרוץ המגיפה, כולל מי שהתגלו כמאומתים לנגיף שוב.
      
      מאומתים - מי שנבדקו ונמצאו חיוביים לנגיף COVID-19 בבדיקת PCR או בבדיקת אנטיגן מפוקחת (החל מה 5.1.2022) , בין אם הופיעו אצלם תסמינים ובין אם לא, בין אם הם חולים, החלימו או נפטרו.
      
      מספר החולים הפעילים במחלת הנגיף COVID-19, נכון למועד העדכון האחרון.
      
      חולים פעילים - מי שנבדקו ונמצאו חיוביים לנגיף COVID-19 בבדיקת PCR או בבדיקת אנטיגן מפוקחת (החל מה 5.1.2022), ללא קשר להופעת תסמינים, שעוד לא הוגדרו כמחלימים ושלא נפטרו.`,
    },
    {
      title: { title: 'חולים קשה', value: '104' },
      stats: [
        { title: 'מתוכם קריטי', value: '33' },
        { title: 'מחוברים לאקמו', value: '0' },
        { title: 'מונשמים', value: '34' },
        { title: 'חולים בינוני', value: '23' },
        { title: 'חולים קל', value: '138' },
      ],
      tooltip: `מספר החולים במצב קשה וקריטי המאושפזים בבתי החולים.

      חולה קשה - מי שחולה במחלת נגיף COVID-19 ושהוגדר במצב קשה או קריטי על ידי מערכת הבריאות.`,
    },
    {
      title: { title: 'מתחסנים', value: '' },
      stats: [
        { value: 'מנה 1', title: '6,718,836' },
        { value: 'מנה 2', title: '6,154,990' },
        { value: 'מנה 3', title: '4,512,024' },
      ],
      tooltip: `מספר מקבלי החיסון מפני נגיף COVID-19 מתחילת מבצע החיסונים לפי מספרי המנות.`,
    },
    {
      title: { title: 'נפטרים מצטבר', value: '11744' },
      stats: [],
      tooltip: `מספר הנפטרים המצטבר ממחלת הנגיף COVID-19 החל מפרוץ המגפה.
      נתוני הנפטרים מתעדכנים לאחר שנבדקו תעודות הפטירה לוידוא סיבת המוות ולכן ייתכנו עדכונים מאוחרים של מספר הנפטרים.`,
    },
    {
      title: { title: 'אחוז נבדקים חיוביים אתמול', value: '8.56%' },
      stats: [{ title: 'נבדקים לגילוי הנגיף אתמול', value: '4523' }],
      tooltip: `אחוז הנבדקים שנמצאו חיוביים לנגיף COVID-19 מתוך מספר נבדקים לגילוי הנגיף אתמול.

      נבדקים לגילוי הנגיף אתמול - מספר הנבדקים לאיתור ראשוני של הנגיף (ללא בדיקות נלוות לקביעת החלמה) בבדיקות PCR או אנטיגן מפוקחות, שהתבצעו ותוצאותיהן התקבלו משעה 00:00 עד שעה 23:59 של יום אתמול.
      
      כלל הבדיקות אתמול – מספר כל תוצאות הבדיקות לגילוי קורונה שבוצעו מסוג PCR או אנטיגן ,הן לבדיקה ראשונית לאיתור הנגיף והן לבדיקות נלוות לקביעת החלמה, שהתקבלו החל מחצות 00:00 עד שעה 23:59 של יום אתמול.`,
    },
    {
      title: { title: 'מקדם הדבקה', value: '1.04' },
      stats: [],
      tooltip: `מקדם הדבקה R - המספר הממוצע של אנשים שידבקו מאדם שנושא את הנגיף COVID-19.
      כשהערך של R גבוה מ-1 - המחלה מתפשטת, כלומר מספר הנדבקים גדל.`,
    },
  ],
  lastSevenDays: [
    {
      title: { title: 'מספר המאומתים', value: '4,576' },
      stats: [{ title: 'משבעה ימים קודמים', value: '6.2%' }],
      tooltip: `מספר המאומתים לנגיף COVID-19 שאותרו ב-7 הימים האחרונים (לא כולל את יום העדכון) והשינוי באחוזים לעומת 7 הימים הקודמים.`,
    },
    {
      title: { title: 'מספר חולים קשה', value: '58' },
      stats: [{ title: 'משבעה ימים קודמים', value: '16%' }],
      tooltip: `מספר החולים החדשים במצב קשה וקריטי במחלת נגיף COVID-19 ב-7 הימים האחרונים (לא כולל את יום העדכון) והשינוי באחוזים לעומת 7 הימים הקודמים.`,
    },
    {
      title: { title: 'מספר נפטרים', value: '7' },
      stats: [{ title: 'משבעה ימים קודמים', value: '-50%' }],
      tooltip: `מספר הנפטרים מנגיף COVID-19 ב-7 הימים האחרונים (לא כולל את יום העדכון) והשינוי באחוזים לעומת 7 הימים הקודמים.`,
    },
    {
      title: { title: 'מספר נבדקים', value: '52,162' },
      stats: [
        { title: 'משבעה ימים קודמים', value: '+12.7%' },
        { title: 'נבדקים חיוביים', value: '8.8%' },
      ],
      tooltip: `מספר הנבדקים בבדיקות לגילוי נגיף COVID-19 מסוג PCR או אנטיגן ב-7 הימים האחרונים (לא כולל את יום העדכון) והשינוי באחוזים לעומת 7 הימים הקודמים.
      הנתון אינו כולל נבדקים בבדיקות נלוות לקביעת החלמה.
      
      נבדקים חיוביים - אחוז הנבדקים שנמצאו חיוביים לנגיף COVID-19 מתוך מספר הנבדקים לגילוי הנגיף ב 7 הימים האחרונים.`,
    },
  ],
};

/*
 * For easier debugging in development mode, you can import the following file
 * to ignore zone related error stack frames such as `zone.run`, `zoneDelegate.invokeTask`.
 *
 * This import should be commented out in production mode because it will have a negative impact
 * on performance if an error is thrown.
 */
// import 'zone.js/plugins/zone-error';  // Included with Angular CLI.
